#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если Не Активный Тогда
		Возврат;
	КонецЕсли;
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ОператорыМаркировки.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ОператорыМаркировки КАК ОператорыМаркировки
	|ГДЕ
	|	ОператорыМаркировки.Страна = &Страна
	|	И ОператорыМаркировки.Активный = ИСТИНА
	|	И ОператорыМаркировки.Ссылка <> &Ссылка";
	
	Запрос.УстановитьПараметр("Страна", Страна);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		ОбъектСсылка = Выборка.Ссылка.ПолучитьОбъект();
		ОбъектСсылка.Активный = Ложь;
		ОбъектСсылка.Записать(РежимЗаписи.Запись);
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
