// @strict-types


#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиСобытийФормы

// Код процедур и функций

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

// Код процедур и функций

#КонецОбласти

#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура Обработать(Команда)
	ОбработатьНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура Повторить(Команда)
	ТекущиеДанные = Элементы.СписокОчереди.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ТекущиеДанные.Идентификатор) Тогда
		Возврат;
	КонецЕсли;
	
	ПовторитьНаСервере(ТекущиеДанные.Идентификатор);
	
	Элементы.СписокОчереди.Обновить();
КонецПроцедуры


#КонецОбласти


#Область СлужебныеПроцедурыИФункции
&НаСервере
Процедура ПовторитьНаСервере(Знач ИдентификаторЗаписи)
	ОчередьОбменаМаркировкиСервер.ПовторнаяПопытка(ИдентификаторЗаписи);
КонецПроцедуры


&НаСервере
Процедура ОбработатьНаСервере()
	ОчередьОбменаМаркировкиСервер.ОбработатьОчередь();
КонецПроцедуры
#КонецОбласти

